{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Distance Matrix"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "executionInfo": {
     "elapsed": 293,
     "status": "ok",
     "timestamp": 1660667405674,
     "user": {
      "displayName": "Javier Jaime",
      "userId": "09621009059201685928"
     },
     "user_tz": 360
    },
    "id": "Xf_7h1rY-LbR"
   },
   "outputs": [],
   "source": [
    "# Import necessary Libraries\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "# !pip3 install neo4j-driver\n",
    "\n",
    "from neo4j import GraphDatabase, basic_auth"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/",
     "height": 1000
    },
    "executionInfo": {
     "elapsed": 297,
     "status": "ok",
     "timestamp": 1660667414103,
     "user": {
      "displayName": "Javier Jaime",
      "userId": "09621009059201685928"
     },
     "user_tz": 360
    },
    "id": "GRRlBgxs-9UI",
    "outputId": "22f4cb82-1d8b-417e-e084-f8553dbedb33"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "31\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Province</th>\n",
       "      <th>City</th>\n",
       "      <th>Latitude</th>\n",
       "      <th>Longitude</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>BC</td>\n",
       "      <td>Abbotsford</td>\n",
       "      <td>49.052116</td>\n",
       "      <td>-122.329479</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>AB</td>\n",
       "      <td>Acheson</td>\n",
       "      <td>53.545914</td>\n",
       "      <td>-113.771576</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>AB</td>\n",
       "      <td>Airdrie</td>\n",
       "      <td>51.285970</td>\n",
       "      <td>-114.010620</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>AB</td>\n",
       "      <td>Balzac</td>\n",
       "      <td>51.215611</td>\n",
       "      <td>-114.004558</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>ON</td>\n",
       "      <td>Bolton</td>\n",
       "      <td>43.879548</td>\n",
       "      <td>-79.738260</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>BC</td>\n",
       "      <td>Burnaby</td>\n",
       "      <td>49.243380</td>\n",
       "      <td>-122.972545</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>AB</td>\n",
       "      <td>Calgary</td>\n",
       "      <td>51.046095</td>\n",
       "      <td>-114.065465</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>BC</td>\n",
       "      <td>Delta</td>\n",
       "      <td>49.084626</td>\n",
       "      <td>-123.057938</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>AB</td>\n",
       "      <td>Edmonton</td>\n",
       "      <td>53.546206</td>\n",
       "      <td>-113.491241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>BC</td>\n",
       "      <td>Errington</td>\n",
       "      <td>49.289463</td>\n",
       "      <td>-124.370630</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>AB</td>\n",
       "      <td>Grande Prairie</td>\n",
       "      <td>55.171080</td>\n",
       "      <td>-118.794987</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>BC</td>\n",
       "      <td>Kamloops</td>\n",
       "      <td>50.675827</td>\n",
       "      <td>-120.339415</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>BC</td>\n",
       "      <td>Kelowna</td>\n",
       "      <td>49.887918</td>\n",
       "      <td>-119.495902</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>BC</td>\n",
       "      <td>Ladysmith</td>\n",
       "      <td>48.993658</td>\n",
       "      <td>-123.815796</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>BC</td>\n",
       "      <td>Langley</td>\n",
       "      <td>49.103929</td>\n",
       "      <td>-122.657047</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>AB</td>\n",
       "      <td>Lethbridge</td>\n",
       "      <td>49.694578</td>\n",
       "      <td>-112.833103</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>AB</td>\n",
       "      <td>Medicine Hat</td>\n",
       "      <td>50.043030</td>\n",
       "      <td>-110.679016</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>BC</td>\n",
       "      <td>Nanaimo</td>\n",
       "      <td>49.163877</td>\n",
       "      <td>-123.938122</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>BC</td>\n",
       "      <td>New Westminster</td>\n",
       "      <td>49.206773</td>\n",
       "      <td>-122.910882</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>AB</td>\n",
       "      <td>Okotoks</td>\n",
       "      <td>50.725369</td>\n",
       "      <td>-113.975082</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>BC</td>\n",
       "      <td>Port Coquitlam</td>\n",
       "      <td>49.262164</td>\n",
       "      <td>-122.780542</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>AB</td>\n",
       "      <td>Red Deer County</td>\n",
       "      <td>52.104022</td>\n",
       "      <td>-113.767473</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>SK</td>\n",
       "      <td>Regina</td>\n",
       "      <td>50.448760</td>\n",
       "      <td>-104.617310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>BC</td>\n",
       "      <td>Richmond</td>\n",
       "      <td>49.163168</td>\n",
       "      <td>-123.137414</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>AB</td>\n",
       "      <td>Rocky View County</td>\n",
       "      <td>51.369935</td>\n",
       "      <td>-114.014186</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>SK</td>\n",
       "      <td>Saskatoon</td>\n",
       "      <td>52.131802</td>\n",
       "      <td>-106.660767</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>AB</td>\n",
       "      <td>Sherwood Park</td>\n",
       "      <td>53.525696</td>\n",
       "      <td>-113.296631</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>AB</td>\n",
       "      <td>St. Albert</td>\n",
       "      <td>53.633239</td>\n",
       "      <td>-113.628845</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>BC</td>\n",
       "      <td>Surrey</td>\n",
       "      <td>49.191303</td>\n",
       "      <td>-122.849143</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>BC</td>\n",
       "      <td>Vancouver</td>\n",
       "      <td>49.260872</td>\n",
       "      <td>-123.113952</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>MB</td>\n",
       "      <td>Winnipeg</td>\n",
       "      <td>49.895537</td>\n",
       "      <td>-97.138458</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Province               City   Latitude   Longitude\n",
       "13       BC         Abbotsford  49.052116 -122.329479\n",
       "0        AB            Acheson  53.545914 -113.771576\n",
       "1        AB            Airdrie  51.285970 -114.010620\n",
       "2        AB             Balzac  51.215611 -114.004558\n",
       "30       ON             Bolton  43.879548  -79.738260\n",
       "14       BC            Burnaby  49.243380 -122.972545\n",
       "3        AB            Calgary  51.046095 -114.065465\n",
       "15       BC              Delta  49.084626 -123.057938\n",
       "4        AB           Edmonton  53.546206 -113.491241\n",
       "16       BC          Errington  49.289463 -124.370630\n",
       "5        AB     Grande Prairie  55.171080 -118.794987\n",
       "17       BC           Kamloops  50.675827 -120.339415\n",
       "18       BC            Kelowna  49.887918 -119.495902\n",
       "19       BC          Ladysmith  48.993658 -123.815796\n",
       "20       BC            Langley  49.103929 -122.657047\n",
       "6        AB         Lethbridge  49.694578 -112.833103\n",
       "7        AB       Medicine Hat  50.043030 -110.679016\n",
       "21       BC            Nanaimo  49.163877 -123.938122\n",
       "22       BC    New Westminster  49.206773 -122.910882\n",
       "8        AB            Okotoks  50.725369 -113.975082\n",
       "23       BC     Port Coquitlam  49.262164 -122.780542\n",
       "9        AB    Red Deer County  52.104022 -113.767473\n",
       "28       SK             Regina  50.448760 -104.617310\n",
       "24       BC           Richmond  49.163168 -123.137414\n",
       "10       AB  Rocky View County  51.369935 -114.014186\n",
       "29       SK          Saskatoon  52.131802 -106.660767\n",
       "11       AB      Sherwood Park  53.525696 -113.296631\n",
       "12       AB         St. Albert  53.633239 -113.628845\n",
       "25       BC             Surrey  49.191303 -122.849143\n",
       "26       BC          Vancouver  49.260872 -123.113952\n",
       "27       MB           Winnipeg  49.895537  -97.138458"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Read Excel file into dataframe\n",
    "cities = pd.read_csv('Western_cities.csv', index_col=0)\n",
    "print(len(cities))\n",
    "cities"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "Ne2Ligl9Lpz0"
   },
   "source": [
    " From OSRM (Open Source Routing Machine)\n",
    " https://github.com/Project-OSRM/osrm-backend/wiki/Server-api"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "executionInfo": {
     "elapsed": 569,
     "status": "ok",
     "timestamp": 1660667414669,
     "user": {
      "displayName": "Javier Jaime",
      "userId": "09621009059201685928"
     },
     "user_tz": 360
    },
    "id": "eKUvm6NGPAWN",
    "outputId": "7e3585bd-e1e2-4278-d918-d95ad108a1f4"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The distance is 297.675 Kms and the duration is 214.2 minutes\n"
     ]
    }
   ],
   "source": [
    "# Test the API with the coordinates from Calgary and Edmonton\n",
    "route_uri = 'http://router.project-osrm.org/route/v1/driving/'\n",
    "loc_pair = '-114.065465,51.046095;-113.507996,53.535411'\n",
    "result = pd.read_json( route_uri + loc_pair,lines=True)\n",
    "distance = result['routes'][0][0]['distance']\n",
    "duration = result['routes'][0][0]['duration']\n",
    "print(\"The distance is\",distance/1000,\"Kms and the duration is\", round(duration/60,2),\"minutes\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "executionInfo": {
     "elapsed": 233250,
     "status": "ok",
     "timestamp": 1660667848872,
     "user": {
      "displayName": "Javier Jaime",
      "userId": "09621009059201685928"
     },
     "user_tz": 360
    },
    "id": "0XGrn0akCq19",
    "outputId": "d9ca3c18-fd39-4f70-beb6-f7c6fdc79433"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "From  Acheson  to  Airdrie  is  275.38 Kms\n",
      "From  Acheson  to  Balzac  is  283.44 Kms\n",
      "From  Acheson  to  Calgary  is  306.36 Kms\n",
      "From  Acheson  to  Edmonton  is  19.98 Kms\n",
      "From  Acheson  to  Grande Prairie  is  440.81 Kms\n",
      "From  Acheson  to  Lethbridge  is  510.79 Kms\n",
      "From  Acheson  to  Medicine Hat  is  567.86 Kms\n",
      "From  Acheson  to  Okotoks  is  344.09 Kms\n",
      "From  Acheson  to  Red Deer County  is  182.27 Kms\n",
      "From  Acheson  to  Rocky View County  is  266.29 Kms\n",
      "From  Acheson  to  Sherwood Park  is  39.67 Kms\n",
      "From  Acheson  to  St. Albert  is  19.9 Kms\n",
      "From  Acheson  to  Abbotsford  is  1076.52 Kms\n",
      "From  Acheson  to  Burnaby  is  1129.44 Kms\n",
      "From  Acheson  to  Delta  is  1135.2 Kms\n",
      "From  Acheson  to  Errington  is  1282.23 Kms\n",
      "From  Acheson  to  Kamloops  is  787.11 Kms\n",
      "From  Acheson  to  Kelowna  is  898.99 Kms\n",
      "From  Acheson  to  Ladysmith  is  1219.09 Kms\n",
      "From  Acheson  to  Langley  is  1103.8 Kms\n",
      "From  Acheson  to  Nanaimo  is  1240.98 Kms\n",
      "From  Acheson  to  New Westminster  is  1125.25 Kms\n",
      "From  Acheson  to  Port Coquitlam  is  1122.56 Kms\n",
      "From  Acheson  to  Richmond  is  1144.92 Kms\n",
      "From  Acheson  to  Surrey  is  1116.32 Kms\n",
      "From  Acheson  to  Vancouver  is  1140.65 Kms\n",
      "From  Acheson  to  Winnipeg  is  1370.34 Kms\n",
      "From  Acheson  to  Regina  is  798.73 Kms\n",
      "From  Acheson  to  Saskatoon  is  542.21 Kms\n",
      "From  Acheson  to  Bolton  is  3543.81 Kms\n",
      "From  Airdrie  to  Balzac  is  10.05 Kms\n",
      "From  Airdrie  to  Calgary  is  32.96 Kms\n",
      "From  Airdrie  to  Edmonton  is  267.9 Kms\n",
      "From  Airdrie  to  Grande Prairie  is  684.7 Kms\n",
      "From  Airdrie  to  Lethbridge  is  237.39 Kms\n",
      "From  Airdrie  to  Medicine Hat  is  312.98 Kms\n",
      "From  Airdrie  to  Okotoks  is  70.69 Kms\n",
      "From  Airdrie  to  Red Deer County  is  109.05 Kms\n",
      "From  Airdrie  to  Rocky View County  is  10.32 Kms\n",
      "From  Airdrie  to  Sherwood Park  is  275.59 Kms\n",
      "From  Airdrie  to  St. Albert  is  287.97 Kms\n",
      "From  Airdrie  to  Abbotsford  is  943.1 Kms\n",
      "From  Airdrie  to  Burnaby  is  996.02 Kms\n",
      "From  Airdrie  to  Delta  is  1001.78 Kms\n",
      "From  Airdrie  to  Errington  is  1148.81 Kms\n",
      "From  Airdrie  to  Kamloops  is  656.81 Kms\n",
      "From  Airdrie  to  Kelowna  is  625.59 Kms\n",
      "From  Airdrie  to  Ladysmith  is  1085.67 Kms\n",
      "From  Airdrie  to  Langley  is  970.38 Kms\n",
      "From  Airdrie  to  Nanaimo  is  1107.56 Kms\n",
      "From  Airdrie  to  New Westminster  is  991.83 Kms\n",
      "From  Airdrie  to  Port Coquitlam  is  989.14 Kms\n",
      "From  Airdrie  to  Richmond  is  1011.5 Kms\n",
      "From  Airdrie  to  Surrey  is  982.9 Kms\n",
      "From  Airdrie  to  Vancouver  is  1007.23 Kms\n",
      "From  Airdrie  to  Winnipeg  is  1345.37 Kms\n",
      "From  Airdrie  to  Regina  is  775.67 Kms\n",
      "From  Airdrie  to  Saskatoon  is  584.59 Kms\n",
      "From  Airdrie  to  Bolton  is  3477.38 Kms\n",
      "From  Balzac  to  Calgary  is  24.12 Kms\n",
      "From  Balzac  to  Edmonton  is  275.92 Kms\n",
      "From  Balzac  to  Grande Prairie  is  692.72 Kms\n",
      "From  Balzac  to  Lethbridge  is  228.55 Kms\n",
      "From  Balzac  to  Medicine Hat  is  304.14 Kms\n",
      "From  Balzac  to  Okotoks  is  61.85 Kms\n",
      "From  Balzac  to  Red Deer County  is  117.07 Kms\n",
      "From  Balzac  to  Rocky View County  is  20.56 Kms\n",
      "From  Balzac  to  Sherwood Park  is  283.61 Kms\n",
      "From  Balzac  to  St. Albert  is  295.99 Kms\n",
      "From  Balzac  to  Abbotsford  is  934.26 Kms\n",
      "From  Balzac  to  Burnaby  is  987.18 Kms\n",
      "From  Balzac  to  Delta  is  992.94 Kms\n",
      "From  Balzac  to  Errington  is  1139.96 Kms\n",
      "From  Balzac  to  Kamloops  is  647.96 Kms\n",
      "From  Balzac  to  Kelowna  is  616.75 Kms\n",
      "From  Balzac  to  Ladysmith  is  1076.83 Kms\n",
      "From  Balzac  to  Langley  is  961.54 Kms\n",
      "From  Balzac  to  Nanaimo  is  1098.72 Kms\n",
      "From  Balzac  to  New Westminster  is  982.99 Kms\n",
      "From  Balzac  to  Port Coquitlam  is  980.29 Kms\n",
      "From  Balzac  to  Richmond  is  1002.65 Kms\n",
      "From  Balzac  to  Surrey  is  974.06 Kms\n",
      "From  Balzac  to  Vancouver  is  998.38 Kms\n",
      "From  Balzac  to  Winnipeg  is  1336.53 Kms\n",
      "From  Balzac  to  Regina  is  766.83 Kms\n",
      "From  Balzac  to  Saskatoon  is  590.22 Kms\n",
      "From  Balzac  to  Bolton  is  3468.54 Kms\n",
      "From  Calgary  to  Edmonton  is  299.03 Kms\n",
      "From  Calgary  to  Grande Prairie  is  715.83 Kms\n",
      "From  Calgary  to  Lethbridge  is  211.85 Kms\n",
      "From  Calgary  to  Medicine Hat  is  293.22 Kms\n",
      "From  Calgary  to  Okotoks  is  45.15 Kms\n",
      "From  Calgary  to  Red Deer County  is  140.18 Kms\n",
      "From  Calgary  to  Rocky View County  is  43.67 Kms\n",
      "From  Calgary  to  Sherwood Park  is  306.72 Kms\n",
      "From  Calgary  to  St. Albert  is  319.1 Kms\n",
      "From  Calgary  to  Abbotsford  is  922.47 Kms\n",
      "From  Calgary  to  Burnaby  is  975.39 Kms\n",
      "From  Calgary  to  Delta  is  981.15 Kms\n",
      "From  Calgary  to  Errington  is  1128.18 Kms\n",
      "From  Calgary  to  Kamloops  is  636.18 Kms\n",
      "From  Calgary  to  Kelowna  is  604.96 Kms\n",
      "From  Calgary  to  Ladysmith  is  1065.04 Kms\n",
      "From  Calgary  to  Langley  is  949.75 Kms\n",
      "From  Calgary  to  Nanaimo  is  1086.93 Kms\n",
      "From  Calgary  to  New Westminster  is  971.2 Kms\n",
      "From  Calgary  to  Port Coquitlam  is  968.51 Kms\n",
      "From  Calgary  to  Richmond  is  990.87 Kms\n",
      "From  Calgary  to  Surrey  is  962.27 Kms\n",
      "From  Calgary  to  Vancouver  is  986.6 Kms\n",
      "From  Calgary  to  Winnipeg  is  1325.61 Kms\n",
      "From  Calgary  to  Regina  is  755.91 Kms\n",
      "From  Calgary  to  Saskatoon  is  613.35 Kms\n",
      "From  Calgary  to  Bolton  is  3457.62 Kms\n",
      "From  Edmonton  to  Grande Prairie  is  458.0 Kms\n",
      "From  Edmonton  to  Lethbridge  is  503.1 Kms\n",
      "From  Edmonton  to  Medicine Hat  is  525.76 Kms\n",
      "From  Edmonton  to  Okotoks  is  336.4 Kms\n",
      "From  Edmonton  to  Red Deer County  is  174.58 Kms\n",
      "From  Edmonton  to  Rocky View County  is  258.6 Kms\n",
      "From  Edmonton  to  Sherwood Park  is  17.1 Kms\n",
      "From  Edmonton  to  St. Albert  is  14.31 Kms\n",
      "From  Edmonton  to  Abbotsford  is  1093.71 Kms\n",
      "From  Edmonton  to  Burnaby  is  1146.63 Kms\n",
      "From  Edmonton  to  Delta  is  1152.39 Kms\n",
      "From  Edmonton  to  Errington  is  1299.42 Kms\n",
      "From  Edmonton  to  Kamloops  is  804.3 Kms\n",
      "From  Edmonton  to  Kelowna  is  891.29 Kms\n",
      "From  Edmonton  to  Ladysmith  is  1236.28 Kms\n",
      "From  Edmonton  to  Langley  is  1120.99 Kms\n",
      "From  Edmonton  to  Nanaimo  is  1258.18 Kms\n",
      "From  Edmonton  to  New Westminster  is  1142.44 Kms\n",
      "From  Edmonton  to  Port Coquitlam  is  1139.75 Kms\n",
      "From  Edmonton  to  Richmond  is  1162.11 Kms\n",
      "From  Edmonton  to  Surrey  is  1133.51 Kms\n",
      "From  Edmonton  to  Vancouver  is  1157.84 Kms\n",
      "From  Edmonton  to  Winnipeg  is  1351.79 Kms\n",
      "From  Edmonton  to  Regina  is  780.18 Kms\n",
      "From  Edmonton  to  Saskatoon  is  523.66 Kms\n",
      "From  Edmonton  to  Bolton  is  3525.26 Kms\n",
      "From  Grande Prairie  to  Lethbridge  is  927.39 Kms\n",
      "From  Grande Prairie  to  Medicine Hat  is  984.46 Kms\n",
      "From  Grande Prairie  to  Okotoks  is  760.69 Kms\n",
      "From  Grande Prairie  to  Red Deer County  is  598.87 Kms\n",
      "From  Grande Prairie  to  Rocky View County  is  682.89 Kms\n",
      "From  Grande Prairie  to  Sherwood Park  is  472.09 Kms\n",
      "From  Grande Prairie  to  St. Albert  is  440.31 Kms\n",
      "From  Grande Prairie  to  Abbotsford  is  1126.09 Kms\n",
      "From  Grande Prairie  to  Burnaby  is  1179.01 Kms\n",
      "From  Grande Prairie  to  Delta  is  1184.77 Kms\n",
      "From  Grande Prairie  to  Errington  is  1331.79 Kms\n",
      "From  Grande Prairie  to  Kamloops  is  836.67 Kms\n",
      "From  Grande Prairie  to  Kelowna  is  1048.54 Kms\n",
      "From  Grande Prairie  to  Ladysmith  is  1268.66 Kms\n",
      "From  Grande Prairie  to  Langley  is  1153.37 Kms\n",
      "From  Grande Prairie  to  Nanaimo  is  1290.55 Kms\n",
      "From  Grande Prairie  to  New Westminster  is  1174.82 Kms\n",
      "From  Grande Prairie  to  Port Coquitlam  is  1172.12 Kms\n",
      "From  Grande Prairie  to  Richmond  is  1194.48 Kms\n",
      "From  Grande Prairie  to  Surrey  is  1165.89 Kms\n",
      "From  Grande Prairie  to  Vancouver  is  1190.21 Kms\n",
      "From  Grande Prairie  to  Winnipeg  is  1804.23 Kms\n",
      "From  Grande Prairie  to  Regina  is  1232.62 Kms\n",
      "From  Grande Prairie  to  Saskatoon  is  976.1 Kms\n",
      "From  Grande Prairie  to  Bolton  is  3977.7 Kms\n",
      "From  Lethbridge  to  Medicine Hat  is  169.74 Kms\n",
      "From  Lethbridge  to  Okotoks  is  171.94 Kms\n",
      "From  Lethbridge  to  Red Deer County  is  343.9 Kms\n",
      "From  Lethbridge  to  Rocky View County  is  247.39 Kms\n",
      "From  Lethbridge  to  Sherwood Park  is  510.44 Kms\n",
      "From  Lethbridge  to  St. Albert  is  522.82 Kms\n",
      "From  Lethbridge  to  Abbotsford  is  1081.0 Kms\n",
      "From  Lethbridge  to  Burnaby  is  1133.92 Kms\n",
      "From  Lethbridge  to  Delta  is  1139.68 Kms\n",
      "From  Lethbridge  to  Errington  is  1286.71 Kms\n",
      "From  Lethbridge  to  Kamloops  is  839.08 Kms\n",
      "From  Lethbridge  to  Kelowna  is  807.86 Kms\n",
      "From  Lethbridge  to  Ladysmith  is  1223.57 Kms\n",
      "From  Lethbridge  to  Langley  is  1108.28 Kms\n",
      "From  Lethbridge  to  Nanaimo  is  1245.47 Kms\n",
      "From  Lethbridge  to  New Westminster  is  1129.73 Kms\n",
      "From  Lethbridge  to  Port Coquitlam  is  1127.04 Kms\n",
      "From  Lethbridge  to  Richmond  is  1149.4 Kms\n",
      "From  Lethbridge  to  Surrey  is  1120.8 Kms\n",
      "From  Lethbridge  to  Vancouver  is  1145.13 Kms\n",
      "From  Lethbridge  to  Winnipeg  is  1193.26 Kms\n",
      "From  Lethbridge  to  Regina  is  623.55 Kms\n",
      "From  Lethbridge  to  Saskatoon  is  614.14 Kms\n",
      "From  Lethbridge  to  Bolton  is  3349.76 Kms\n",
      "From  Medicine Hat  to  Okotoks  is  289.2 Kms\n",
      "From  Medicine Hat  to  Red Deer County  is  393.83 Kms\n",
      "From  Medicine Hat  to  Rocky View County  is  321.79 Kms\n",
      "From  Medicine Hat  to  Sherwood Park  is  511.28 Kms\n",
      "From  Medicine Hat  to  St. Albert  is  544.85 Kms\n",
      "From  Medicine Hat  to  Abbotsford  is  1212.35 Kms\n",
      "From  Medicine Hat  to  Burnaby  is  1265.27 Kms\n",
      "From  Medicine Hat  to  Delta  is  1271.03 Kms\n",
      "From  Medicine Hat  to  Errington  is  1418.06 Kms\n",
      "From  Medicine Hat  to  Kamloops  is  926.06 Kms\n",
      "From  Medicine Hat  to  Kelowna  is  894.84 Kms\n",
      "From  Medicine Hat  to  Ladysmith  is  1354.92 Kms\n",
      "From  Medicine Hat  to  Langley  is  1239.63 Kms\n",
      "From  Medicine Hat  to  Nanaimo  is  1376.81 Kms\n",
      "From  Medicine Hat  to  New Westminster  is  1261.08 Kms\n",
      "From  Medicine Hat  to  Port Coquitlam  is  1258.39 Kms\n",
      "From  Medicine Hat  to  Richmond  is  1280.75 Kms\n",
      "From  Medicine Hat  to  Surrey  is  1252.15 Kms\n",
      "From  Medicine Hat  to  Vancouver  is  1276.48 Kms\n",
      "From  Medicine Hat  to  Winnipeg  is  1035.69 Kms\n",
      "From  Medicine Hat  to  Regina  is  465.99 Kms\n",
      "From  Medicine Hat  to  Saskatoon  is  446.53 Kms\n",
      "From  Medicine Hat  to  Bolton  is  3167.7 Kms\n",
      "From  Okotoks  to  Red Deer County  is  178.01 Kms\n",
      "From  Okotoks  to  Rocky View County  is  81.5 Kms\n",
      "From  Okotoks  to  Sherwood Park  is  344.56 Kms\n",
      "From  Okotoks  to  St. Albert  is  356.94 Kms\n",
      "From  Okotoks  to  Abbotsford  is  959.49 Kms\n",
      "From  Okotoks  to  Burnaby  is  1012.41 Kms\n",
      "From  Okotoks  to  Delta  is  1018.17 Kms\n",
      "From  Okotoks  to  Errington  is  1165.19 Kms\n",
      "From  Okotoks  to  Kamloops  is  673.19 Kms\n",
      "From  Okotoks  to  Kelowna  is  641.98 Kms\n",
      "From  Okotoks  to  Ladysmith  is  1102.06 Kms\n",
      "From  Okotoks  to  Langley  is  986.77 Kms\n",
      "From  Okotoks  to  Nanaimo  is  1123.95 Kms\n",
      "From  Okotoks  to  New Westminster  is  1008.22 Kms\n",
      "From  Okotoks  to  Port Coquitlam  is  1005.53 Kms\n",
      "From  Okotoks  to  Richmond  is  1027.88 Kms\n",
      "From  Okotoks  to  Surrey  is  999.29 Kms\n",
      "From  Okotoks  to  Vancouver  is  1023.62 Kms\n",
      "From  Okotoks  to  Winnipeg  is  1322.49 Kms\n",
      "From  Okotoks  to  Regina  is  752.78 Kms\n",
      "From  Okotoks  to  Saskatoon  is  643.18 Kms\n",
      "From  Okotoks  to  Bolton  is  3454.5 Kms\n",
      "From  Red Deer County  to  Rocky View County  is  100.0 Kms\n",
      "From  Red Deer County  to  Sherwood Park  is  181.36 Kms\n",
      "From  Red Deer County  to  St. Albert  is  193.74 Kms\n",
      "From  Red Deer County  to  Abbotsford  is  1050.2 Kms\n",
      "From  Red Deer County  to  Burnaby  is  1103.12 Kms\n",
      "From  Red Deer County  to  Delta  is  1108.88 Kms\n",
      "From  Red Deer County  to  Errington  is  1255.9 Kms\n",
      "From  Red Deer County  to  Kamloops  is  763.9 Kms\n",
      "From  Red Deer County  to  Kelowna  is  732.69 Kms\n",
      "From  Red Deer County  to  Ladysmith  is  1192.77 Kms\n",
      "From  Red Deer County  to  Langley  is  1077.48 Kms\n",
      "From  Red Deer County  to  Nanaimo  is  1214.66 Kms\n",
      "From  Red Deer County  to  New Westminster  is  1098.93 Kms\n",
      "From  Red Deer County  to  Port Coquitlam  is  1096.24 Kms\n",
      "From  Red Deer County  to  Richmond  is  1118.59 Kms\n",
      "From  Red Deer County  to  Surrey  is  1090.0 Kms\n",
      "From  Red Deer County  to  Vancouver  is  1114.33 Kms\n",
      "From  Red Deer County  to  Winnipeg  is  1338.8 Kms\n",
      "From  Red Deer County  to  Regina  is  767.19 Kms\n",
      "From  Red Deer County  to  Saskatoon  is  557.5 Kms\n",
      "From  Red Deer County  to  Bolton  is  3500.31 Kms\n",
      "From  Rocky View County  to  Sherwood Park  is  266.28 Kms\n",
      "From  Rocky View County  to  St. Albert  is  278.66 Kms\n",
      "From  Rocky View County  to  Abbotsford  is  952.89 Kms\n",
      "From  Rocky View County  to  Burnaby  is  1005.81 Kms\n",
      "From  Rocky View County  to  Delta  is  1011.57 Kms\n",
      "From  Rocky View County  to  Errington  is  1158.6 Kms\n",
      "From  Rocky View County  to  Kamloops  is  666.6 Kms\n",
      "From  Rocky View County  to  Kelowna  is  635.38 Kms\n",
      "From  Rocky View County  to  Ladysmith  is  1095.46 Kms\n",
      "From  Rocky View County  to  Langley  is  980.17 Kms\n",
      "From  Rocky View County  to  Nanaimo  is  1117.35 Kms\n",
      "From  Rocky View County  to  New Westminster  is  1001.62 Kms\n",
      "From  Rocky View County  to  Port Coquitlam  is  998.93 Kms\n",
      "From  Rocky View County  to  Richmond  is  1021.29 Kms\n",
      "From  Rocky View County  to  Surrey  is  992.69 Kms\n",
      "From  Rocky View County  to  Vancouver  is  1017.02 Kms\n",
      "From  Rocky View County  to  Winnipeg  is  1355.16 Kms\n",
      "From  Rocky View County  to  Regina  is  785.46 Kms\n",
      "From  Rocky View County  to  Saskatoon  is  580.9 Kms\n",
      "From  Rocky View County  to  Bolton  is  3487.17 Kms\n",
      "From  Sherwood Park  to  St. Albert  is  34.11 Kms\n",
      "From  Sherwood Park  to  Abbotsford  is  1110.39 Kms\n",
      "From  Sherwood Park  to  Burnaby  is  1163.32 Kms\n",
      "From  Sherwood Park  to  Delta  is  1169.08 Kms\n",
      "From  Sherwood Park  to  Errington  is  1316.1 Kms\n",
      "From  Sherwood Park  to  Kamloops  is  820.98 Kms\n",
      "From  Sherwood Park  to  Kelowna  is  899.89 Kms\n",
      "From  Sherwood Park  to  Ladysmith  is  1252.96 Kms\n",
      "From  Sherwood Park  to  Langley  is  1137.68 Kms\n",
      "From  Sherwood Park  to  Nanaimo  is  1274.86 Kms\n",
      "From  Sherwood Park  to  New Westminster  is  1159.12 Kms\n",
      "From  Sherwood Park  to  Port Coquitlam  is  1156.43 Kms\n",
      "From  Sherwood Park  to  Richmond  is  1178.79 Kms\n",
      "From  Sherwood Park  to  Surrey  is  1150.2 Kms\n",
      "From  Sherwood Park  to  Vancouver  is  1174.52 Kms\n",
      "From  Sherwood Park  to  Winnipeg  is  1340.68 Kms\n",
      "From  Sherwood Park  to  Regina  is  769.07 Kms\n",
      "From  Sherwood Park  to  Saskatoon  is  512.55 Kms\n",
      "From  Sherwood Park  to  Bolton  is  3514.15 Kms\n",
      "From  St. Albert  to  Abbotsford  is  1088.62 Kms\n",
      "From  St. Albert  to  Burnaby  is  1141.54 Kms\n",
      "From  St. Albert  to  Delta  is  1147.3 Kms\n",
      "From  St. Albert  to  Errington  is  1294.33 Kms\n",
      "From  St. Albert  to  Kamloops  is  799.21 Kms\n",
      "From  St. Albert  to  Kelowna  is  910.68 Kms\n",
      "From  St. Albert  to  Ladysmith  is  1231.19 Kms\n",
      "From  St. Albert  to  Langley  is  1115.9 Kms\n",
      "From  St. Albert  to  Nanaimo  is  1253.08 Kms\n",
      "From  St. Albert  to  New Westminster  is  1137.35 Kms\n",
      "From  St. Albert  to  Port Coquitlam  is  1134.66 Kms\n",
      "From  St. Albert  to  Richmond  is  1157.02 Kms\n",
      "From  St. Albert  to  Surrey  is  1128.42 Kms\n",
      "From  St. Albert  to  Vancouver  is  1152.75 Kms\n",
      "From  St. Albert  to  Winnipeg  is  1365.26 Kms\n",
      "From  St. Albert  to  Regina  is  793.64 Kms\n",
      "From  St. Albert  to  Saskatoon  is  537.13 Kms\n",
      "From  St. Albert  to  Bolton  is  3538.72 Kms\n",
      "From  Abbotsford  to  Burnaby  is  55.08 Kms\n",
      "From  Abbotsford  to  Delta  is  60.84 Kms\n",
      "From  Abbotsford  to  Errington  is  207.87 Kms\n",
      "From  Abbotsford  to  Kamloops  is  289.71 Kms\n",
      "From  Abbotsford  to  Kelowna  is  324.94 Kms\n",
      "From  Abbotsford  to  Ladysmith  is  144.73 Kms\n",
      "From  Abbotsford  to  Langley  is  29.44 Kms\n",
      "From  Abbotsford  to  Nanaimo  is  166.62 Kms\n",
      "From  Abbotsford  to  New Westminster  is  50.89 Kms\n",
      "From  Abbotsford  to  Port Coquitlam  is  48.2 Kms\n",
      "From  Abbotsford  to  Richmond  is  70.56 Kms\n",
      "From  Abbotsford  to  Surrey  is  41.96 Kms\n",
      "From  Abbotsford  to  Vancouver  is  66.29 Kms\n",
      "From  Abbotsford  to  Winnipeg  is  2237.19 Kms\n",
      "From  Abbotsford  to  Regina  is  1667.49 Kms\n",
      "From  Abbotsford  to  Saskatoon  is  1517.5 Kms\n",
      "From  Abbotsford  to  Bolton  is  4303.67 Kms\n",
      "From  Burnaby  to  Delta  is  28.19 Kms\n",
      "From  Burnaby  to  Errington  is  174.74 Kms\n",
      "From  Burnaby  to  Kamloops  is  341.82 Kms\n",
      "From  Burnaby  to  Kelowna  is  377.06 Kms\n",
      "From  Burnaby  to  Ladysmith  is  111.6 Kms\n",
      "From  Burnaby  to  Langley  is  33.59 Kms\n",
      "From  Burnaby  to  Nanaimo  is  133.5 Kms\n",
      "From  Burnaby  to  New Westminster  is  7.47 Kms\n",
      "From  Burnaby  to  Port Coquitlam  is  17.5 Kms\n",
      "From  Burnaby  to  Richmond  is  21.07 Kms\n",
      "From  Burnaby  to  Surrey  is  13.5 Kms\n",
      "From  Burnaby  to  Vancouver  is  11.63 Kms\n",
      "From  Burnaby  to  Winnipeg  is  2289.3 Kms\n",
      "From  Burnaby  to  Regina  is  1719.6 Kms\n",
      "From  Burnaby  to  Saskatoon  is  1569.62 Kms\n",
      "From  Burnaby  to  Bolton  is  4331.59 Kms\n",
      "From  Delta  to  Errington  is  149.47 Kms\n",
      "From  Delta  to  Kamloops  is  349.63 Kms\n",
      "From  Delta  to  Kelowna  is  384.86 Kms\n",
      "From  Delta  to  Ladysmith  is  86.34 Kms\n",
      "From  Delta  to  Langley  is  33.98 Kms\n",
      "From  Delta  to  Nanaimo  is  108.23 Kms\n",
      "From  Delta  to  New Westminster  is  26.91 Kms\n",
      "From  Delta  to  Port Coquitlam  is  38.21 Kms\n",
      "From  Delta  to  Richmond  is  14.98 Kms\n",
      "From  Delta  to  Surrey  is  24.6 Kms\n",
      "From  Delta  to  Vancouver  is  23.91 Kms\n",
      "From  Delta  to  Winnipeg  is  2297.11 Kms\n",
      "From  Delta  to  Regina  is  1727.41 Kms\n",
      "From  Delta  to  Saskatoon  is  1577.42 Kms\n",
      "From  Delta  to  Bolton  is  4324.15 Kms\n",
      "From  Errington  to  Kamloops  is  492.97 Kms\n",
      "From  Errington  to  Kelowna  is  528.2 Kms\n",
      "From  Errington  to  Ladysmith  is  63.54 Kms\n",
      "From  Errington  to  Langley  is  177.32 Kms\n",
      "From  Errington  to  Nanaimo  is  41.89 Kms\n",
      "From  Errington  to  New Westminster  is  171.91 Kms\n",
      "From  Errington  to  Port Coquitlam  is  183.22 Kms\n",
      "From  Errington  to  Richmond  is  161.07 Kms\n",
      "From  Errington  to  Surrey  is  169.61 Kms\n",
      "From  Errington  to  Vancouver  is  170.0 Kms\n",
      "From  Errington  to  Winnipeg  is  2440.45 Kms\n",
      "From  Errington  to  Regina  is  1870.75 Kms\n",
      "From  Errington  to  Saskatoon  is  1720.76 Kms\n",
      "From  Errington  to  Bolton  is  4467.49 Kms\n",
      "From  Kamloops  to  Kelowna  is  210.83 Kms\n",
      "From  Kamloops  to  Ladysmith  is  430.94 Kms\n",
      "From  Kamloops  to  Langley  is  315.65 Kms\n",
      "From  Kamloops  to  Nanaimo  is  452.84 Kms\n",
      "From  Kamloops  to  New Westminster  is  337.1 Kms\n",
      "From  Kamloops  to  Port Coquitlam  is  334.41 Kms\n",
      "From  Kamloops  to  Richmond  is  356.77 Kms\n",
      "From  Kamloops  to  Surrey  is  328.18 Kms\n",
      "From  Kamloops  to  Vancouver  is  352.5 Kms\n",
      "From  Kamloops  to  Winnipeg  is  1950.73 Kms\n",
      "From  Kamloops  to  Regina  is  1381.02 Kms\n",
      "From  Kamloops  to  Saskatoon  is  1322.98 Kms\n",
      "From  Kamloops  to  Bolton  is  4082.73 Kms\n",
      "From  Kelowna  to  Ladysmith  is  467.33 Kms\n",
      "From  Kelowna  to  Langley  is  352.04 Kms\n",
      "From  Kelowna  to  Nanaimo  is  489.22 Kms\n",
      "From  Kelowna  to  New Westminster  is  373.49 Kms\n",
      "From  Kelowna  to  Port Coquitlam  is  370.8 Kms\n",
      "From  Kelowna  to  Richmond  is  393.16 Kms\n",
      "From  Kelowna  to  Surrey  is  364.56 Kms\n",
      "From  Kelowna  to  Vancouver  is  388.89 Kms\n",
      "From  Kelowna  to  Winnipeg  is  1927.36 Kms\n",
      "From  Kelowna  to  Regina  is  1357.65 Kms\n",
      "From  Kelowna  to  Saskatoon  is  1207.67 Kms\n",
      "From  Kelowna  to  Bolton  is  4046.27 Kms\n",
      "From  Ladysmith  to  Langley  is  113.78 Kms\n",
      "From  Ladysmith  to  Nanaimo  is  22.54 Kms\n",
      "From  Ladysmith  to  New Westminster  is  108.38 Kms\n",
      "From  Ladysmith  to  Port Coquitlam  is  119.68 Kms\n",
      "From  Ladysmith  to  Richmond  is  97.53 Kms\n",
      "From  Ladysmith  to  Surrey  is  106.07 Kms\n",
      "From  Ladysmith  to  Vancouver  is  106.46 Kms\n",
      "From  Ladysmith  to  Winnipeg  is  2376.91 Kms\n",
      "From  Ladysmith  to  Regina  is  1807.21 Kms\n",
      "From  Ladysmith  to  Saskatoon  is  1657.22 Kms\n",
      "From  Ladysmith  to  Bolton  is  4403.95 Kms\n",
      "From  Langley  to  Nanaimo  is  137.89 Kms\n",
      "From  Langley  to  New Westminster  is  30.42 Kms\n",
      "From  Langley  to  Port Coquitlam  is  24.56 Kms\n",
      "From  Langley  to  Richmond  is  41.84 Kms\n",
      "From  Langley  to  Surrey  is  19.4 Kms\n",
      "From  Langley  to  Vancouver  is  45.82 Kms\n",
      "From  Langley  to  Winnipeg  is  2263.28 Kms\n",
      "From  Langley  to  Regina  is  1693.57 Kms\n",
      "From  Langley  to  Saskatoon  is  1543.59 Kms\n",
      "From  Langley  to  Bolton  is  4304.64 Kms\n",
      "From  Nanaimo  to  New Westminster  is  130.75 Kms\n",
      "From  Nanaimo  to  Port Coquitlam  is  142.06 Kms\n",
      "From  Nanaimo  to  Richmond  is  119.91 Kms\n",
      "From  Nanaimo  to  Surrey  is  128.45 Kms\n",
      "From  Nanaimo  to  Vancouver  is  128.83 Kms\n",
      "From  Nanaimo  to  Winnipeg  is  2399.29 Kms\n",
      "From  Nanaimo  to  Regina  is  1829.58 Kms\n",
      "From  Nanaimo  to  Saskatoon  is  1679.6 Kms\n",
      "From  Nanaimo  to  Bolton  is  4426.33 Kms\n",
      "From  New Westminster  to  Port Coquitlam  is  13.65 Kms\n",
      "From  New Westminster  to  Richmond  is  22.23 Kms\n",
      "From  New Westminster  to  Surrey  is  6.55 Kms\n",
      "From  New Westminster  to  Vancouver  is  18.08 Kms\n",
      "From  New Westminster  to  Winnipeg  is  2285.45 Kms\n",
      "From  New Westminster  to  Regina  is  1715.75 Kms\n",
      "From  New Westminster  to  Saskatoon  is  1565.77 Kms\n",
      "From  New Westminster  to  Bolton  is  4327.63 Kms\n",
      "From  Port Coquitlam  to  Richmond  is  36.85 Kms\n",
      "From  Port Coquitlam  to  Surrey  is  14.84 Kms\n",
      "From  Port Coquitlam  to  Vancouver  is  30.65 Kms\n",
      "From  Port Coquitlam  to  Winnipeg  is  2283.43 Kms\n",
      "From  Port Coquitlam  to  Regina  is  1713.72 Kms\n",
      "From  Port Coquitlam  to  Saskatoon  is  1563.74 Kms\n",
      "From  Port Coquitlam  to  Bolton  is  4327.81 Kms\n",
      "From  Richmond  to  Surrey  is  30.94 Kms\n",
      "From  Richmond  to  Vancouver  is  13.24 Kms\n",
      "From  Richmond  to  Winnipeg  is  2304.74 Kms\n",
      "From  Richmond  to  Regina  is  1735.04 Kms\n",
      "From  Richmond  to  Saskatoon  is  1585.05 Kms\n",
      "From  Richmond  to  Bolton  is  4331.78 Kms\n",
      "From  Surrey  to  Vancouver  is  24.86 Kms\n",
      "From  Surrey  to  Winnipeg  is  2276.63 Kms\n",
      "From  Surrey  to  Regina  is  1706.92 Kms\n",
      "From  Surrey  to  Saskatoon  is  1556.94 Kms\n",
      "From  Surrey  to  Bolton  is  4317.38 Kms\n",
      "From  Vancouver  to  Winnipeg  is  2300.64 Kms\n",
      "From  Vancouver  to  Regina  is  1730.94 Kms\n",
      "From  Vancouver  to  Saskatoon  is  1580.95 Kms\n",
      "From  Vancouver  to  Bolton  is  4340.88 Kms\n",
      "From  Winnipeg  to  Regina  is  572.52 Kms\n",
      "From  Winnipeg  to  Saskatoon  is  826.21 Kms\n",
      "From  Winnipeg  to  Bolton  is  2098.82 Kms\n",
      "From  Regina  to  Saskatoon  is  257.86 Kms\n",
      "From  Regina  to  Bolton  is  2740.69 Kms\n",
      "From  Saskatoon  to  Bolton  is  3003.1 Kms\n"
     ]
    }
   ],
   "source": [
    "# Create a new dataframe for the Distance Matrix\n",
    "matrix = pd.DataFrame()\n",
    "origin = []\n",
    "destination = []\n",
    "durations = []\n",
    "distances = []\n",
    "\n",
    "# Loop trough cites to fill the Distance Matrix\n",
    "for i in range(len(cities)):\n",
    "  for j in range(i+1, len(cities)):\n",
    "    origin.append(cities['City'][i])\n",
    "    LatO = cities['Latitude'][i]\n",
    "    LonO = cities['Longitude'][i]\n",
    "    destination.append(cities['City'][j])\n",
    "    LatD = cities['Latitude'][j]\n",
    "    LonD = cities['Longitude'][j]\n",
    "    \n",
    "    # Location pair of coordinates\n",
    "    loc_pair = str(LonO) + ',' + str(LatO) + ';' + str(LonD) + ',' + str(LatD)\n",
    "\n",
    "    #pass the location pairs to the OSRM API, read to json and extract routs and duration\n",
    "    result = pd.read_json( route_uri + loc_pair,lines=True)\n",
    "    distance = result['routes'][0][0]['distance']/1000\n",
    "    duration = result['routes'][0][0]['duration']/60\n",
    "\n",
    "    #Print results as they are coming\n",
    "    print('From ',cities['City'][i],' to ',cities['City'][j],' is ',round(distance,2), 'Kms')\n",
    "    \n",
    "    #append result to list\n",
    "    distances.append(distance)\n",
    "    durations.append(duration)\n",
    "\n",
    "matrix['Origin'] = origin\n",
    "matrix['Destination'] = destination\n",
    "matrix['Distance'] = distances\n",
    "matrix['Duration'] = durations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/",
     "height": 206
    },
    "executionInfo": {
     "elapsed": 13,
     "status": "ok",
     "timestamp": 1660667849113,
     "user": {
      "displayName": "Javier Jaime",
      "userId": "09621009059201685928"
     },
     "user_tz": 360
    },
    "id": "rtRL2Ly4JsTj",
    "outputId": "d1bb7431-db76-4d5e-bda8-bb55b0a4791b"
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Origin</th>\n",
       "      <th>Destination</th>\n",
       "      <th>Distance</th>\n",
       "      <th>Duration</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Acheson</td>\n",
       "      <td>Airdrie</td>\n",
       "      <td>275.3799</td>\n",
       "      <td>200.381667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Acheson</td>\n",
       "      <td>Balzac</td>\n",
       "      <td>283.4424</td>\n",
       "      <td>204.070000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Acheson</td>\n",
       "      <td>Calgary</td>\n",
       "      <td>306.3613</td>\n",
       "      <td>221.810000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Acheson</td>\n",
       "      <td>Edmonton</td>\n",
       "      <td>19.9815</td>\n",
       "      <td>26.041667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Acheson</td>\n",
       "      <td>Grande Prairie</td>\n",
       "      <td>440.8077</td>\n",
       "      <td>311.815000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    Origin     Destination  Distance    Duration\n",
       "0  Acheson         Airdrie  275.3799  200.381667\n",
       "1  Acheson          Balzac  283.4424  204.070000\n",
       "2  Acheson         Calgary  306.3613  221.810000\n",
       "3  Acheson        Edmonton   19.9815   26.041667\n",
       "4  Acheson  Grande Prairie  440.8077  311.815000"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "matrix.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "executionInfo": {
     "elapsed": 244,
     "status": "ok",
     "timestamp": 1660667849112,
     "user": {
      "displayName": "Javier Jaime",
      "userId": "09621009059201685928"
     },
     "user_tz": 360
    },
    "id": "-iS9m6cDTomc"
   },
   "outputs": [],
   "source": [
    "# Export Distance Matrix to CSV File\n",
    "matrix.to_csv('Western_Distances.csv')\n",
    "\n",
    "# Copy Cities and Distance Matrix to Neo4j import directory\n",
    "!cp Western_cities.csv \"..\\.Neo4jDesktop\\relate-data\\dbmss\\dbms-176846de-aaed-4ac4-a331-2e5b4bc9b6c8\\import\"\n",
    "!cp Western_Distances.csv \"..\\.Neo4jDesktop\\relate-data\\dbmss\\dbms-176846de-aaed-4ac4-a331-2e5b4bc9b6c8\\import\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Neo4j Driver"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "<ipython-input-17-973a9c82003d>:5: ExperimentalWarning: The configuration may change in the future.\n",
      "  driver.verify_connectivity()\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Neo4j/4.4.5'"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Connect to neo4j\n",
    "\n",
    "uri = \"bolt://localhost:7687\"\n",
    "driver = GraphDatabase.driver(uri, auth=basic_auth(\"neo4j\", \"alts\"))\n",
    "driver.verify_connectivity()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Delete Previous Graph\n",
    "\n",
    "delete_graph = ''' \n",
    "MATCH (n)\n",
    "DETACH DELETE n\n",
    "'''\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "   session.run(delete_graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Load Distance Matrix CSV File\n",
    "\n",
    "load_distance = ''' \n",
    "LOAD CSV WITH HEADERS FROM 'file:///Western_Distances.csv' AS row\n",
    "MERGE (o:City {name: row.Origin})\n",
    "MERGE (d:City {name: row.Destination})\n",
    "MERGE (o)-[r:ROAD {distance: toFloat(row.Distance), duration: toFloat(row.Duration)}]->(d)\n",
    "'''\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "   session.run(load_distance)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create Graph Projection\n",
    "project_graph = ''' \n",
    "CALL gds.graph.project(\n",
    "  'westernCities',\n",
    "  'City',\n",
    "  {\n",
    "    ROAD: {\n",
    "      type: 'ROAD',\n",
    "      properties: 'duration',\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  }\n",
    ")\n",
    "'''\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "   session.run(project_graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Run the Minimum Weight Spanning Tree algorithm and write back results to the graph\n",
    "mst_query = ''' \n",
    "MATCH (n:City {name: 'Bolton'})\n",
    "CALL gds.alpha.spanningTree.minimum.write('westernCities', {\n",
    "  startNodeId: id(n),\n",
    "  relationshipWeightProperty: 'duration',\n",
    "  writeProperty: 'MINST',\n",
    "  weightWriteProperty: 'writeCost'\n",
    "})\n",
    "YIELD preProcessingMillis, computeMillis, writeMillis, effectiveNodeCount\n",
    "RETURN preProcessingMillis, computeMillis, writeMillis, effectiveNodeCount;\n",
    "'''\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "   session.run(mst_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Minimum Spanning Tree - Western Cities - Canada\n",
      "\n",
      "From Bolton to Airdrie takes 20.5 minutes\n",
      "From Airdrie to Langley takes 18.0 minutes\n",
      "From Langley to Regina takes 12.4 minutes\n",
      "From Regina to Saskatoon takes 18.0 minutes\n",
      "From Regina to Acheson takes 10.5 minutes\n",
      "From Acheson to Vancouver takes 24.4 minutes\n",
      "From Vancouver to Ladysmith takes 28.6 minutes\n",
      "From Ladysmith to Port Coquitlam takes 199.5 minutes\n",
      "From Port Coquitlam to Richmond takes 147.3 minutes\n",
      "From Richmond to Red Deer County takes 501.5 minutes\n",
      "From Red Deer County to Burnaby takes 37.5 minutes\n",
      "From Burnaby to St. Albert takes 131.8 minutes\n",
      "From St. Albert to Abbotsford takes 137.8 minutes\n",
      "From Abbotsford to Calgary takes 328.2 minutes\n",
      "From Calgary to Balzac takes 412.7 minutes\n",
      "From Balzac to Grande Prairie takes 1541.5 minutes\n",
      "From Calgary to Edmonton takes 186.0 minutes\n",
      "From Red Deer County to Okotoks takes 22.0 minutes\n",
      "From Okotoks to Medicine Hat takes 11.0 minutes\n",
      "From Medicine Hat to Errington takes 13.5 minutes\n",
      "From Errington to Delta takes 81.2 minutes\n",
      "From Delta to Rocky View County takes 137.2 minutes\n",
      "From Rocky View County to Kamloops takes 21.0 minutes\n",
      "From Rocky View County to Kelowna takes 20.9 minutes\n",
      "From Kelowna to Lethbridge takes 21.6 minutes\n",
      "From Lethbridge to Sherwood Park takes 311.8 minutes\n",
      "From Bolton to Nanaimo takes 18.7 minutes\n",
      "From Nanaimo to Surrey takes 247.6 minutes\n",
      "From Surrey to Winnipeg takes 23.1 minutes\n",
      "From Winnipeg to New Westminster takes 41.1 minutes\n"
     ]
    }
   ],
   "source": [
    "cypher_query = '''\n",
    "MATCH path = (c:City {name: 'Bolton'})-[:MINST*]-()\n",
    "WITH relationships(path) AS rels\n",
    "UNWIND rels AS rel\n",
    "WITH DISTINCT rel AS rel\n",
    "RETURN startNode(rel).name AS origin, endNode(rel).name AS destination, rel.writeCost AS duration\n",
    "'''\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "  results = session.read_transaction(\n",
    "    lambda tx: tx.run(cypher_query,\n",
    "                      limit=500).data())\n",
    "  print('Minimum Spanning Tree - Western Cities - Canada\\n')\n",
    "  for record in results:\n",
    "    print('From', record['origin'],'to', record['destination'], 'takes', round(record['duration'],1), 'minutes')\n",
    "\n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Shortest Path Cities: ['Bolton', 'Calgary']\n",
      "Shortest Path Durations: [0.0, 1304.155]\n"
     ]
    }
   ],
   "source": [
    "dijkstra_query = '''\n",
    "MATCH (o:City {name: 'Bolton'})\n",
    "MATCH (d:City {name: 'Calgary'})\n",
    "WHERE NOT (o:City {name: 'Bolton'})-[:ROAD]->(d:City {name: 'Calgary'})\n",
    "CALL gds.shortestPath.dijkstra.stream('westernCities', {\n",
    "        sourceNode: o, \n",
    "        targetNode: d,\n",
    "        relationshipWeightProperty: 'duration'\n",
    "        })\n",
    "YIELD nodeIds, costs\n",
    "RETURN [x in gds.util.asNodes(nodeIds)| x.name] AS cities, costs AS duration\n",
    "'''\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "  results = session.read_transaction(\n",
    "    lambda tx: tx.run(dijkstra_query,\n",
    "                      limit=100).data())\n",
    "  for record in results:\n",
    "    print('Shortest Path Cities:', record['cities'])\n",
    "    print('Shortest Path Durations:', record['duration'])\n",
    "\n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Load Cities CSV File\n",
    "\n",
    "load_cities = ''' \n",
    "LOAD CSV WITH HEADERS FROM 'file:///Western_cities.csv' AS row\n",
    "MERGE (c:City {name: row.City})\n",
    "MERGE (p:Province {name: row.Province})\n",
    "SET c.latitude=toFloat(row.Latitude), \n",
    "    c.longitude=toFloat(row.Longitude), \n",
    "    c.point = point({latitude: toFloat(row.Latitude),\n",
    "                    longitude: toFloat(row.Longitude)})\n",
    "'''\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "   session.run(load_cities)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nereast City: Medicine Hat\n",
      "Nereast City: Okotoks\n",
      "Nereast City: Red Deer County\n",
      "Nereast City: Rocky View County\n",
      "Nereast City: Sherwood Park\n",
      "Nereast City: St. Albert\n",
      "Nereast City: Abbotsford\n",
      "Nereast City: Burnaby\n",
      "Nereast City: Delta\n",
      "Nereast City: Lethbridge\n"
     ]
    }
   ],
   "source": [
    "# Find N nearest cities by a given point\n",
    "point = 'point({latitude: 51.046095, longitude: -114.065465})'\n",
    "N=10 # Number of Cities\n",
    "\n",
    "query = '''\n",
    "MATCH (c:City)\n",
    "WITH c, distance(c.point, $point) as distance\n",
    "RETURN c.name, distance\n",
    "ORDER BY distance\n",
    "LIMIT $N\n",
    "'''\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "  results = session.read_transaction(\n",
    "    lambda tx: tx.run(query, point=point, N=N).data())\n",
    "  for record in results:\n",
    "    print('Nereast City:', record['c.name'])\n",
    "    \n",
    "driver.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "colab": {
   "authorship_tag": "ABX9TyPyjB8TpvwYi5tImV55DHUA",
   "collapsed_sections": [],
   "mount_file_id": "1noapFlEzvPakV9lU32e4kSJFCdkPSGro",
   "name": "Distance_Matrix_with_OSRM.ipynb",
   "provenance": []
  },
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
